In [1]:
import numpy as np
import pandas as pd

In [22]:
df1 = pd.read_csv(r"C:\Users\PRATIBHA GUPTA\AppData\Roaming\jupyter\black_friday_train.csv")

In [23]:
df2 = pd.read_csv(r"C:\Users\PRATIBHA GUPTA\AppData\Roaming\jupyter\black_friday_test.csv")

In [42]:
df1.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [44]:
df1.shape

(550068, 12)

In [25]:
df2.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,M,46-50,7,B,2,1,1,11.0,NaN
1,1000009,P00113442,M,26-35,17,C,0,0,3,5.0,NaN
2,1000010,P00288442,F,36-45,1,B,4+,1,5,14.0,NaN
3,1000010,P00145342,F,36-45,1,B,4+,1,4,9.0,NaN
4,1000011,P00053842,F,26-35,1,C,1,0,4,5.0,12.0

In [45]:
df2.shape

(233599, 11)

In [26]:
df1.describe()

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
count,5.500680e+05,550068.000000,550068.000000,550068.000000,376430.000000,166821.000000,550068.000000
mean,1.003029e+06,8.076707,0.409653,5.404270,9.842329,12.668243,9263.968713
std,1.727592e+03,6.522660,0.491770,3.936211,5.086590,4.125338,5023.065394
min,1.000001e+06,0.000000,0.000000,1.000000,2.000000,3.000000,12.000000
25%,1.001516e+06,2.000000,0.000000,1.000000,5.000000,9.000000,5823.000000
50%,1.003077e+06,7.000000,0.000000,5.000000,9.000000,14.000000,8047.000000
75%,1.004478e+06,14.000000,1.000000,8.000000,15.000000,16.000000,12054.000000
max,1.006040e+06,20.000000,1.000000,20.000000,18.000000,18.000000,23961.000000

In [27]:
# correlation between data
df1.corr()

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
User_ID,1.000000,-0.023971,0.020443,0.003825,0.001529,0.003419,0.004716
Occupation,-0.023971,1.000000,0.024280,-0.007618,-0.000384,0.013263,0.020833
Marital_Status,0.020443,0.024280,1.000000,0.019888,0.015138,0.019473,-0.000463
Product_Category_1,0.003825,-0.007618,0.019888,1.000000,0.540583,0.229678,-0.343703
Product_Category_2,0.001529,-0.000384,0.015138,0.540583,1.000000,0.543649,-0.209918
Product_Category_3,0.003419,0.013263,0.019473,0.229678,0.543649,1.000000,-0.022006
Purchase,0.004716,0.020833,-0.000463,-0.343703,-0.209918,-0.022006,1.000000

In [28]:
# concating test and train data
data = pd.concat([df1,df2], ignore_index = True, sort = False)

In [29]:
data.shape

(783667, 12)

In [30]:
# checking null values in  all columns
data.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            245982
Product_Category_3            545809
Purchase                      233599
dtype: int64

In [31]:
# checking unique values in all columns
data.apply(lambda x: len(x.unique()))

User_ID                        5891
Product_ID                     3677
Gender                            2
Age                               7
Occupation                       21
City_Category                     3
Stay_In_Current_City_Years        5
Marital_Status                    2
Product_Category_1               20
Product_Category_2               18
Product_Category_3               16
Purchase                      18106
dtype: int64

In [32]:
# converting gender to numeric value
gender_dict = {'F':0, 'M':1}
data["Gender"] = data["Gender"].apply(lambda x: gender_dict[x])

In [33]:
# converting age to numeric value
age_dict = {"0-17":0, '18-25':1, '26-35':2, '36-45':3, '46-50':4, '51-55':5, '55+':6}
data["Age"] = data["Age"].apply(lambda x: age_dict[x])

In [34]:
# converting city category into numeric value
city_dict = {'A':0, 'B':1, 'C':2}
data["City_Category"] = data["City_Category"].apply(lambda x: city_dict[x])

In [36]:
data["Stay_In_Current_City_Years"].unique()

array(['2', '4+', '3', '1', '0'], dtype=object)

In [37]:
#converting stay in current years to numeric values
curr_dict = {'0':0, '1':1,'2':2,'3':3,'4+':4}
data['Stay_In_Current_City_Years'] = data["Stay_In_Current_City_Years"].apply(lambda x: curr_dict[x])

In [65]:
# filling nan with zeros in product category
data["Product_Category_2"].fillna(0,inplace = True)
data["Product_Category_3"].fillna(0,inplace = True)
data["Purchase"].fillna(0,inplace = True)

In [66]:
train_data = data[0:550068]
test_data = data[550068:]

In [67]:
train_data.shape

(550068, 12)

In [68]:
y_train_data = train_data["Purchase"]
train_data.drop(["Purchase"],axis= 1,inplace = True)

c:\users\pratibha gupta\appdata\local\programs\python\python37-32\lib\site-packages\pandas\core\frame.py:4117: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [69]:
# leaving product id and user id 
x_train_data = train_data.iloc[ : ,2:]

In [78]:
x_train_temp = x_train_data[0:350000]
x_test_temp = x_train_data[350000:]

In [79]:
y_train_temp = y_train_data[0:350000]
y_test_temp = y_train_data[350000:]

In [80]:
x_train_temp.head()

,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,0,0,10,0,2,0,3,0.0,0.0
1,0,0,10,0,2,0,1,6.0,14.0
2,0,0,10,0,2,0,12,0.0,0.0
3,0,0,10,0,2,0,12,14.0,0.0
4,1,6,16,2,4,0,8,0.0,0.0

In [81]:
# training model on linear regression
from sklearn.linear_model import LinearRegression
LR = LinearRegression(normalize=True)
LR.fit(x_train_temp,y_train_temp)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=True)

In [82]:
# predicting output for test data
y_pred = LR.predict(x_test_temp)

In [85]:
from sklearn import metrics

In [86]:
rmse = sklearn.metrics.mean_squared_error(y_test_temp, y_pred)

In [87]:
rmse

21328950.269806616

In [88]:
from sklearn.tree import DecisionTreeRegressor
DT = DecisionTreeRegressor(max_depth=15, min_samples_leaf=100)

In [89]:
# decision tree model
DT.fit(x_train_temp,y_train_temp)

DecisionTreeRegressor(criterion='mse', max_depth=15, max_features=None,
                      max_leaf_nodes=None, min_impurity_decrease=0.0,
                      min_impurity_split=None, min_samples_leaf=100,
                      min_samples_split=2, min_weight_fraction_leaf=0.0,
                      presort=False, random_state=None, splitter='best')

In [90]:
y_pred1 = DT.predict(x_test_temp)

In [91]:
rmse1 = sklearn.metrics.mean_squared_error(y_test_temp, y_pred1)

In [92]:
rmse1

8695696.180096744

In [93]:
# random forest model
RF = DecisionTreeRegressor(max_depth=8, min_samples_leaf=150)
RF.fit(x_train_temp,y_train_temp)

DecisionTreeRegressor(criterion='mse', max_depth=8, max_features=None,
                      max_leaf_nodes=None, min_impurity_decrease=0.0,
                      min_impurity_split=None, min_samples_leaf=150,
                      min_samples_split=2, min_weight_fraction_leaf=0.0,
                      presort=False, random_state=None, splitter='best')

In [94]:
y_pred2 = RF.predict(x_test_temp)

In [95]:
rmse2 = sklearn.metrics.mean_squared_error(y_test_temp, y_pred2)

In [96]:
rmse2

8884294.468246717

In [99]:
from sklearn.linear_model import Ridge
RR = Ridge(alpha=0.05,normalize=True)

In [100]:
#Ridge Regression Model
RR.fit(x_train_temp,y_train_temp)

Ridge(alpha=0.05, copy_X=True, fit_intercept=True, max_iter=None,
      normalize=True, random_state=None, solver='auto', tol=0.001)

In [101]:
y_pred3 = RR.predict(x_test_temp)
rmse3 = sklearn.metrics.mean_squared_error(y_test_temp, y_pred3)

In [102]:
rmse3

21366812.09734133

In [ ]:
# as we can see that the decision tree is best fitting the model as its rmse is minimum than others.